{
  "course_code": "MATH-181",
  "course_title": "Finite Mathematics",
  "last_update": "2025-10-15T10:17:34",
  "sections": [
    {
      "section_number": "8239",
      "units": "3.00",
      "instructor": "Murai, Lauren, Prerequisite: Placement as determined by the college's multiple measures assessment process or completion of a course taught at or above the level of intermediate algebra Note: TI-83 or TI-84 graphing calculator required. Note: Section 8239 is linked to MATH-081-8154, a support course for MATH-181 students. Students must enroll in both MATH-081-8154 and MATH-181-8239 in order to be eligible for this section. The combined classes meet on TTH from 6:00-8:05pm.",
      "meetings": [
        {
          "days": "T Th",
          "time": "6:00PM - 7:25PM",
          "room": "103",
          "format": "in-person"
        }
      ],
      "status": "Open"
    },
    {
      "section_number": "6045",
      "units": "3.00",
      "instructor": "Murai, Lauren, Prerequisite: Placement as determined by the college's multiple measures assessment process or completion of a course taught at or above the level of intermediate algebra Note: TI-83 or TI-84 graphing calculator required. Note: Section 6045 is part of the DVC PACE program. Students must be a PACE student to enroll. For program and registration information, go to www.dvc.edu/pace.  Class meets weekly as scheduled. Class meets on-campus as scheduled.  Note: Section 6045 is linked to MATH-081-6035, a support course for MATH-181 students. Students must enroll in both MATH-081-6035 and MATH-181-6045 in order to be eligible for this section. The combined classes meet on TTH from 6:00-8:05pm.",
      "meetings": [
        {
          "days": "T Th",
          "time": "6:00PM - 7:25PM",
          "room": "103",
          "format": "in-person"
        }
      ],
      "status": "Open"
    }
  ],
  "prerequisites": "Placement as determined by the college's multiple measures assessment process or completion of a course taught at or above the level of intermediate algebra"
}