{
  "course_code": "PHYS-125",
  "course_title": "Calculus Supplement for Physics 121",
  "last_update": "2025-10-15T10:22:14",
  "sections": [
    {
      "section_number": "9040",
      "units": "0.50",
      "instructor": "Lee, Kyung-Min, Prerequisite: PHYS-121 and MATH-183 or 193 (all may be taken concurrently) or equivalents. Note: The calculus component may be required for certain transfer majors. Note: Partially online course. This class includes both online and in person components. You will complete and submit worksheets online. You will also take two quizzes/exams in person on Thursday, 4/23 and 5/21 from 8:30 to 9:55pm in room E225. These in person class sessions are mandatory. Online instruction will be provided via the internet through the college learning management system Canvas and zoom software. On the course start date, log into Canvas, www.dvc.edu/online to locate course.",
      "meetings": [
        {
          "days": "",
          "time": "",
          "room": "PART-ONL",
          "format": "hybrid"
        },
        {
          "days": "Th",
          "time": "8:30PM - 9:55PM",
          "room": "E225",
          "format": "in-person"
        }
      ],
      "status": "Open"
    },
    {
      "section_number": "8316",
      "units": "0.50",
      "instructor": "Westlander, Meghan, Prerequisite: PHYS-121 and MATH-183 or 193 (all may be taken concurrently) or equivalents. Note: The calculus component may be required for certain transfer majors. Note: 100% online course with required meetings Saturdays 5/2 and 5/9, 2:45-7:00pm (online through Zoom). Instruction will be provided through the college learning management system Canvas and Zoom software. Access to a computer with audio and video capability is required. On the course start date, log into Canvas, www.dvc.edu/online to begin.",
      "meetings": [
        {
          "days": "S",
          "time": "2:45PM - 7:00PM",
          "room": "ONLINE",
          "format": "online"
        }
      ],
      "status": "Open"
    }
  ],
  "prerequisites": "PHYS-121 and MATH-183 or 193 (all may be taken concurrently) or equivalents."
}