{
  "course_code": "MATH-082",
  "course_title": "Support for Calculus for Management, Life Science, and Social Science I",
  "last_update": "2025-10-15T10:15:26",
  "sections": [
    {
      "section_number": "8142",
      "units": "2.00",
      "instructor": "Asghary, Zahra, This course provides students with supportto be successful in MATH-182 Calculus for Management, Life Science and Social Science I. Studies show significantly improved success rates for students who enroll in a support course to accompany their transfer-level math course. This courseis a co-requisite to MATH-182 and provides additional support for students who want to feel more confident in their math skills. Note: Section 8142, a support course for MATH-182 students, is linked to MATH-182-8143. Students must enroll in both MATH-082-8142 and MATH-182-8143 in order to be eligible for this section.  The combined classes meet on MTWTH 6:30-8:35pm. Note: Partially online course with required on-campus meetings 6:30 - 8:35 pm on Thursdays 2/26, 4/9, 5/14 (exams) and 5/21 (final exam) and online meetings, Mondays, Tuesdays, Wednesdays, and Thursdays 6:30 - 8:35 pm, through Zoom.  Online instruction will be provided through the college learning management system Canvas and Zoom software. Access to a computer with audio and video capability is required. On the course start date, log into Canvas, www.dvc.edu/online to locate course.",
      "meetings": [
        {
          "days": "M T W Th",
          "time": "7:20PM - 7:45PM",
          "room": "PART-ONL",
          "format": "hybrid"
        },
        {
          "days": "Th",
          "time": "7:20PM - 7:45PM",
          "room": "103",
          "format": "in-person"
        },
        {
          "days": "M T W Th",
          "time": "7:45PM - 8:35PM",
          "room": "PART-ONL",
          "format": "hybrid"
        },
        {
          "days": "Th",
          "time": "7:45PM - 8:35PM",
          "room": "103",
          "format": "in-person"
        }
      ],
      "status": "Open"
    },
    {
      "section_number": "6301",
      "units": "2.00",
      "instructor": "Asghary, Zahra, This course provides students with supportto be successful in MATH-182 Calculus for Management, Life Science and Social Science I. Studies show significantly improved success rates for students who enroll in a support course to accompany their transfer-level math course. This courseis a co-requisite to MATH-182 and provides additional support for students who want to feel more confident in their math skills. Note: Section 6301 is part of the DVC PACE program. Students must be a PACE student to enroll. For program and registration information, go to www.dvc.edu/pace.  Note: Section 6301, a support course for MATH-182 students, is linked to MATH-182-6333. Students must enroll in both MATH-082-6301 and MATH-182-6333 in order to be eligible for this section. The combined classes meet on MTWTH 6:30-8:35pm. Note: Partially online course with required on-campus meetings 6:30 - 8:35 pm on Thursdays 2/26, 4/9, 5/14 (exams) and 5/21 (final exam) and online meetings, Mondays, Tuesdays, Wednesdays, and Thursdays 6:30 - 8:35 pm, through Zoom.  Online instruction will be provided through the college learning management system Canvas and Zoom software. Access to a computer with audio and video capability is required. On the course start date, log into Canvas, www.dvc.edu/online to locate course.",
      "meetings": [
        {
          "days": "M T W Th",
          "time": "7:20PM - 7:45PM",
          "room": "PART-ONL",
          "format": "hybrid"
        },
        {
          "days": "Th",
          "time": "7:20PM - 7:45PM",
          "room": "103",
          "format": "in-person"
        },
        {
          "days": "M T W Th",
          "time": "7:45PM - 8:35PM",
          "room": "PART-ONL",
          "format": "hybrid"
        },
        {
          "days": "Th",
          "time": "7:45PM - 8:35PM",
          "room": "103",
          "format": "in-person"
        }
      ],
      "status": "Open"
    },
    {
      "section_number": "2569",
      "units": "2.00",
      "instructor": "Huynh, My, This course provides students with supportto be successful in MATH-182 Calculus for Management, Life Science and Social Science I. Studies show significantly improved success rates for students who enroll in a support course to accompany their transfer-level math course. This courseis a co-requisite to MATH-182 and provides additional support for students who want to feel more confident in their math skills. Note: Section 2569, a support course for MATH-182 students, is linked to MATH-182-2591. Students must enroll in both MATH-082-2569 and MATH-182-2591 in order to be eligible for this section.  The combined classes meet on MTWTH 8:55-11:00am. Class meets on-campus as scheduled.",
      "meetings": [
        {
          "days": "M T W Th",
          "time": "9:45AM - 10:10AM",
          "room": "105",
          "format": "in-person"
        },
        {
          "days": "M T W Th",
          "time": "10:10AM - 11:00AM",
          "room": "105",
          "format": "in-person"
        }
      ],
      "status": "Open"
    },
    {
      "section_number": "2452",
      "units": "2.00",
      "instructor": "Chan, Kwai-Ching, This course provides students with supportto be successful in MATH-182 Calculus for Management, Life Science and Social Science I. Studies show significantly improved success rates for students who enroll in a support course to accompany their transfer-level math course. This courseis a co-requisite to MATH-182 and provides additional support for students who want to feel more confident in their math skills. Note: Section 2452, a support course for MATH-182 students, is linked to MATH-182-2593. Students must enroll in both MATH-082-2452 and MATH-182-2593 in order to be eligible for this section.  The combined classes meet on MTWTH 1:25-3:30pm. Class meets on-campus as scheduled.",
      "meetings": [
        {
          "days": "M T W Th",
          "time": "2:15PM - 2:40PM",
          "room": "107",
          "format": "in-person"
        },
        {
          "days": "M T W Th",
          "time": "2:40PM - 3:30PM",
          "room": "107",
          "format": "in-person"
        }
      ],
      "status": "Open"
    }
  ]
}