{
  "course_code": "BIOSC-171",
  "course_title": "Environmental Science with Laboratory",
  "last_update": "2025-10-15T09:58:42",
  "sections": [
    {
      "section_number": "9145",
      "units": "4.00",
      "instructor": "Cole Ekberg, Marci, Advisory: ENGL-C1000 or equivalent. NOTE: Students who have successfully completed BIOSC-170 should not enroll in BIOSC-171. Students who have successfully completed BIOSC-170 will not receive credit for BIOSC-171. Class field trips will be organized to local sites related to course topics. Note: Partially online course with required lab meetings Wednesday 9:35AM- 12:35 PM (on-campus lab, see room on schedule) with all other instruction provided online through the college learning management system Canvas. On the course start date, log into Canvas, www.dvc.edu/online to locate course.",
      "meetings": [
        {
          "days": "",
          "time": "",
          "room": "PART-ONL",
          "format": "hybrid"
        },
        {
          "days": "M",
          "time": "9:35AM - 12:40PM",
          "room": "E235",
          "format": "in-person"
        }
      ],
      "status": "Open"
    },
    {
      "section_number": "1101",
      "units": "4.00",
      "instructor": "Staff, DVC",
      "meetings": [
        {
          "days": "T Th",
          "time": "11:10AM - 12:35PM",
          "room": "223",
          "format": "in-person"
        },
        {
          "days": "T",
          "time": "12:55PM - 4:05PM",
          "room": "202",
          "format": "in-person"
        }
      ],
      "status": "Open"
    },
    {
      "section_number": "1100",
      "units": "4.00",
      "instructor": "Taugher, Kimberly, Advisory: ENGL-C1000 or equivalent. NOTE: Students who have successfully completed BIOSC-170 should not enroll in BIOSC-171. Students who have successfully completed BIOSC-170 will not receive credit for BIOSC-171. Class field trips will be organized to local sites related to course topics. Note: Partially online course with required on-campus meetings for lab, Thursdays 9:35AM-12:45PM (see room on schedule). All other instruction provided online through the college learning management system Canvas. On the course start date, log into Canvas, www.dvc.edu/online to locate course.",
      "meetings": [
        {
          "days": "",
          "time": "",
          "room": "PART-ONL",
          "format": "hybrid"
        },
        {
          "days": "Th",
          "time": "9:30AM - 12:40PM",
          "room": "202",
          "format": "in-person"
        }
      ],
      "status": "Open"
    },
    {
      "section_number": "1099",
      "units": "4.00",
      "instructor": "Taugher, Kimberly, Advisory: ENGL-C1000 or equivalent. NOTE: Students who have successfully completed BIOSC-170 should not enroll in BIOSC-171. Students who have successfully completed BIOSC-170 will not receive credit for BIOSC-171. Class field trips will be organized to local sites related to course topics. Note: Partially online course with required on-campus meetings for lab, Tuesdays 9:35AM-12:45PM (see room on schedule). All other instruction provided online through the college learning management system Canvas. On the course start date, log into Canvas, www.dvc.edu/online to locate course.",
      "meetings": [
        {
          "days": "",
          "time": "",
          "room": "PART-ONL",
          "format": "hybrid"
        },
        {
          "days": "T",
          "time": "9:30AM - 12:40PM",
          "room": "202",
          "format": "in-person"
        }
      ],
      "status": "Open"
    }
  ]
}